{
  "vocab": {
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3,
    "<|im_start|>": 4,
    "<|im_end|>": 5,
    "你": 6,
    "好": 7,
    "请": 8,
    "介": 9,
    "绍": 10,
    "一": 11,
    "下": 12,
    "自": 13,
    "己": 14,
    "我": 15,
    "是": 16,
    "M": 17,
    "y": 18,
    "L": 19,
    "个": 20,
    "小": 21,
    "型": 22,
    "语": 23,
    "言": 24,
    "模": 25,
    "从": 26,
    "零": 27,
    "开": 28,
    "始": 29,
    "训": 30,
    "练": 31,
    "的": 32,
    "虽": 33,
    "然": 34,
    "规": 35,
    "很": 36,
    "但": 37,
    "正": 38,
    "在": 39,
    "努": 40,
    "力": 41,
    "学": 42,
    "习": 43,
    "中": 44,
    "文": 45,
    "对": 46,
    "话": 47,
    "什": 48,
    "么": 49,
    "人": 50,
    "工": 51,
    "智": 52,
    "能": 53,
    "让": 54,
    "计": 55,
    "算": 56,
    "机": 57,
    "拟": 58,
    "类": 59,
    "技": 60,
    "术": 61,
    "它": 62,
    "包": 63,
    "括": 64,
    "器": 65,
    "深": 66,
    "度": 67,
    "等": 68,
    "方": 69,
    "法": 70,
    "可": 71,
    "以": 72,
    "实": 73,
    "现": 74,
    "图": 75,
    "像": 76,
    "识": 77,
    "别": 78,
    "音": 79,
    "处": 80,
    "理": 81,
    "功": 82,
    "如": 83,
    "何": 84,
    "编": 85,
    "程": 86,
    "几": 87,
    "步": 88,
    "1": 89,
    ".": 90,
    "选": 91,
    "择": 92,
    "门": 93,
    "入": 94,
    "P": 95,
    "t": 96,
    "h": 97,
    "o": 98,
    "n": 99,
    "2": 100,
    "基": 101,
    "础": 102,
    "和": 103,
    "概": 104,
    "念": 105,
    "3": 106,
    "多": 107,
    "动": 108,
    "手": 109,
    "写": 110,
    "代": 111,
    "码": 112,
    "4": 113,
    "做": 114,
    "项": 115,
    "目": 116,
    "巩": 117,
    "固": 118,
    "知": 119,
    "5": 120,
    "遇": 121,
    "到": 122,
    "问": 123,
    "题": 124,
    "查": 125,
    "资": 126,
    "料": 127,
    "思": 128,
    "考": 129,
    "今": 130,
    "天": 131,
    "气": 132,
    "怎": 133,
    "样": 134,
    "抱": 135,
    "歉": 136,
    "无": 137,
    "获": 138,
    "取": 139,
    "时": 140,
    "信": 141,
    "息": 142,
    "没": 143,
    "有": 144,
    "联": 145,
    "网": 146,
    "建": 147,
    "议": 148,
    "看": 149,
    "预": 150,
    "报": 151,
    "应": 152,
    "用": 153,
    "或": 154,
    "站": 155,
    "准": 156,
    "确": 157,
    "会": 158,
    "数": 159,
    "吗": 160,
    "尝": 161,
    "试": 162,
    "些": 163,
    "简": 164,
    "单": 165,
    "限": 166,
    "于": 167,
    "复": 168,
    "杂": 169,
    "使": 170,
    "软": 171,
    "件": 172,
    "更": 173,
    "讲": 174,
    "笑": 175,
    "给": 176,
    "为": 177,
    "序": 178,
    "员": 179,
    "总": 180,
    "分": 181,
    "不": 182,
    "清": 183,
    "万": 184,
    "圣": 185,
    "节": 186,
    "诞": 187,
    "因": 188,
    "O": 189,
    "c": 190,
    "=": 191,
    "D": 192,
    "e": 193,
    "八": 194,
    "进": 195,
    "制": 196,
    "十": 197,
    "推": 198,
    "荐": 199,
    "本": 200,
    "书": 201,
    "《": 202,
    "》": 203,
    "这": 204,
    "作": 205,
    "者": 206,
    "I": 207,
    "a": 208,
    "G": 209,
    "d": 210,
    "f": 211,
    "l": 212,
    "w": 213,
    "领": 214,
    "域": 215,
    "经": 216,
    "典": 217,
    "教": 218,
    "材": 219,
    "系": 220,
    "统": 221,
    "地": 222,
    "了": 223,
    "神": 224,
    "络": 225,
    "喜": 226,
    "欢": 227,
    "A": 228,
    "真": 229,
    "被": 230,
    "设": 231,
    "来": 232,
    "帮": 233,
    "助": 234,
    "们": 235,
    "解": 236,
    "答": 237,
    "行": 238,
    "命": 239,
    "户": 240,
    "满": 241,
    "意": 242,
    "反": 243,
    "馈": 244,
    "+": 245,
    "最": 246,
    "运": 247,
    "谢": 248,
    "客": 249,
    "高": 250,
    "兴": 251,
    "果": 252,
    "还": 253,
    "其": 254,
    "他": 255,
    "随": 256,
    "大": 257,
    "种": 258,
    "通": 259,
    "过": 260,
    "海": 261,
    "量": 262,
    "上": 263,
    "生": 264,
    "成": 265,
    "著": 266,
    "名": 267,
    "T": 268,
    "C": 269,
    "u": 270,
    "Q": 271,
    "回": 272,
    "提": 273,
    "供": 274,
    "由": 275,
    "尽": 276,
    "r": 277,
    "s": 278,
    "m": 279,
    "架": 280,
    "构": 281,
    "g": 282,
    "0": 283,
    "7": 284,
    "年": 285,
    "出": 286,
    "注": 287,
    "列": 288,
    "据": 289,
    "B": 290,
    "E": 291,
    "R": 292,
    "够": 293,
    "关": 294,
    "输": 295,
    "相": 296,
    "部": 297,
    "每": 298,
    "位": 299,
    "置": 300,
    "与": 301,
    "性": 302,
    "后": 303,
    "根": 304,
    "加": 305,
    "权": 306,
    "求": 307,
    "重": 308,
    "要": 309,
    "变": 310,
    "循": 311,
    "环": 312,
    "函": 313,
    "常": 314,
    "库": 315,
    "N": 316,
    "际": 317,
    "阅": 318,
    "读": 319,
    "谁": 320,
    "创": 321,
    "造": 322,
    "演": 323,
    "示": 324,
    "原": 325,
    "而": 326,
    "?": 327,
    "支": 328,
    "律": 329,
    "需": 330,
    "明": 331,
    "监": 332,
    "督": 333,
    "强": 334,
    "化": 335,
    "区": 336,
    "子": 337,
    "集": 338,
    "层": 339,
    "特": 340,
    "征": 341,
    "效": 342,
    "显": 343,
    "仿": 344,
    "脑": 345,
    "结": 346,
    "元": 347,
    "组": 348,
    "连": 349,
    "接": 350,
    "终": 351,
    "调": 352,
    "整": 353,
    "合": 354,
    "U": 355,
    "形": 356,
    "初": 357,
    "渲": 358,
    "染": 359,
    "并": 360,
    "广": 361,
    "泛": 362,
    "比": 363,
    "幅": 364,
    "速": 365,
    "矩": 366,
    "阵": 367,
    "表": 368,
    "新": 369,
    "差": 370,
    "象": 371,
    "记": 372,
    "住": 373,
    "非": 374,
    "则": 375,
    "p": 376,
    "增": 377,
    "缓": 378,
    "损": 379,
    "失": 380,
    "衡": 381,
    "测": 382,
    "值": 383,
    "距": 384,
    "标": 385,
    "见": 386,
    "均": 387,
    "误": 388,
    "归": 389,
    "交": 390,
    "叉": 391,
    "熵": 392,
    "梯": 393,
    "降": 394,
    "优": 395,
    "参": 396,
    "沿": 397,
    "向": 398,
    "逐": 399,
    "找": 400,
    "率": 401,
    "控": 402,
    "次": 403,
    "长": 404,
    "太": 405,
    "震": 406,
    "荡": 407,
    "收": 408,
    "敛": 409,
    "慢": 410,
    "适": 411,
    "也": 412,
    "态": 413,
    "k": 414,
    "i": 415,
    "z": 416,
    "词": 417,
    "将": 418,
    "切": 419,
    "字": 420,
    "符": 421,
    "级": 422,
    "平": 423,
    "义": 424,
    "完": 425,
    "b": 426,
    "离": 427,
    "散": 428,
    "号": 429,
    "映": 430,
    "射": 431,
    "续": 432,
    "捕": 433,
    "捉": 434,
    "似": 435,
    "空": 436,
    "间": 437,
    "较": 438,
    "近": 439,
    "S": 440,
    "x": 441,
    "激": 442,
    "活": 443,
    "任": 444,
    "转": 445,
    "换": 446,
    "布": 447,
    "所": 448,
    "素": 449,
    "之": 450,
    "且": 451,
    "防": 452,
    "止": 453,
    "依": 454,
    "赖": 455,
    "某": 456,
    "减": 457,
    "轻": 458,
    "残": 459,
    "直": 460,
    "F": 461,
    "(": 462,
    ")": 463,
    "流": 464,
    "消": 465,
    "稳": 466,
    "定": 467,
    "释": 468,
    "例": 469,
    "务": 470,
    "超": 471,
    "具": 472,
    "旨": 473,
    "改": 474,
    "式": 475,
    "难": 476,
    "全": 477,
    "情": 478,
    "感": 479,
    "协": 480,
    "未": 481,
    "师": 482,
    "线": 483,
    "论": 484,
    "掌": 485,
    "握": 486,
    "积": 487,
    "累": 488,
    "验": 489,
    "持": 490,
    "犯": 491,
    "错": 492,
    "产": 493,
    "内": 494,
    "容": 495,
    "批": 496,
    "判": 497,
    "待": 498,
    "证": 499,
    "再": 500,
    "希": 501,
    "望": 502,
    "迎": 503,
    "少": 504,
    "乘": 505,
    "6": 506,
    "除": 507,
    "质": 508,
    "只": 509,
    "身": 510,
    "都": 511,
    "密": 512,
    "猫": 513,
    "物": 514,
    "呼": 515,
    "吸": 516,
    "那": 517,
    "三": 518,
    "段": 519,
    "前": 520,
    "「": 521,
    "」": 522,
    "农": 523,
    "夫": 524,
    "羊": 525,
    "9": 526,
    "外": 527,
    "跑": 528,
    "剩": 529,
    "说": 530,
    "执": 531,
    "块": 532,
    ":": 533,
    "打": 534,
    "印": 535,
    "遍": 536,
    "历": 537,
    "操": 538,
    "主": 539,
    "[": 540,
    "]": 541,
    "圆": 542,
    "省": 543,
    "存": 544,
    "储": 545,
    "键": 546,
    "递": 547,
    "况": 548,
    "条": 549,
    "阶": 550,
    "!": 551,
    "*": 552,
    "-": 553,
    "仔": 554,
    "细": 555,
    "句": 556,
    "检": 557,
    "边": 558,
    "界": 559,
    "排": 560,
    "休": 561,
    "路": 562,
    "口": 563,
    "互": 564,
    "范": 565,
    "服": 566,
    "格": 567,
    "版": 568,
    "跟": 569,
    "踪": 570,
    "核": 571,
    "心": 572,
    "团": 573,
    "队": 574,
    "管": 575,
    "首": 576,
    "春": 577,
    "短": 578,
    "诗": 579,
    "风": 580,
    "拂": 581,
    "柳": 582,
    "丝": 583,
    "花": 584,
    "园": 585,
    "蝶": 586,
    "飞": 587,
    "忙": 588,
    "溪": 589,
    "潺": 590,
    "歌": 591,
    "声": 592,
    "起": 593,
    "苏": 594,
    "暖": 595,
    "阳": 596,
    "光": 597,
    "山": 598,
    "勤": 599,
    "径": 600,
    "涯": 601,
    "苦": 602,
    "舟": 603,
    "副": 604,
    "勉": 605,
    "励": 606,
    "奋": 607,
    "刻": 608,
    "爱": 609,
    "斯": 610,
    "坦": 611,
    "恒": 612,
    "宇": 613,
    "宙": 614,
    "绝": 615,
    "引": 616,
    "²": 617,
    "越": 618,
    "快": 619,
    "弯": 620,
    "故": 621,
    "事": 622,
    "蚂": 623,
    "蚁": 624,
    "想": 625,
    "搬": 626,
    "粒": 627,
    "倍": 628,
    "米": 629,
    "放": 630,
    "弃": 631,
    "伙": 632,
    "伴": 633,
    "告": 634,
    "诉": 635,
    "就": 636,
    "坚": 637,
    "球": 638,
    "月": 639,
    "远": 640,
    "约": 641,
    "8": 642,
    "公": 643,
    "里": 644,
    "秒": 645,
    "颗": 646,
    "星": 647,
    "按": 648,
    "水": 649,
    "金": 650,
    "火": 651,
    "木": 652,
    "土": 653,
    "王": 654,
    "冥": 655,
    "矮": 656,
    "蓝": 657,
    "色": 658,
    "呈": 659,
    "瑞": 660,
    "利": 661,
    "含": 662,
    "各": 663,
    "颜": 664,
    "波": 665,
    "易": 666,
    "眼": 667,
    "睛": 668,
    "氢": 669,
    "氧": 670,
    "H": 671,
    "₂": 672,
    "两": 673,
    "共": 674,
    "价": 675,
    "必": 676,
    "植": 677,
    "二": 678,
    "碳": 679,
    "葡": 680,
    "萄": 681,
    "糖": 682,
    "→": 683,
    "₆": 684,
    "₁": 685,
    "道": 686,
    "违": 687,
    "德": 688,
    "益": 689,
    "安": 690,
    "乐": 691,
    "伤": 692,
    "害": 693,
    "困": 694,
    "负": 695,
    "面": 696,
    "绪": 697,
    "寻": 698,
    "专": 699,
    "业": 700,
    "决": 701,
    "发": 702,
    "史": 703,
    "趋": 704,
    "势": 705,
    "研": 706,
    "究": 707,
    "世": 708,
    "场": 709,
    "景": 710,
    "科": 711,
    "J": 712,
    "v": 713,
    "页": 714,
    "偏": 715,
    "趣": 716,
    "课": 717,
    "虑": 718,
    "展": 719,
    "热": 720,
    "析": 721,
    "体": 722,
    "厉": 723,
    "秀": 724,
    "司": 725,
    "影": 726,
    "响": 727,
    "哪": 728,
    "评": 729,
    "觉": 730,
    "疲": 731,
    "惫": 732,
    "当": 733,
    "松": 734,
    "低": 735,
    "压": 736,
    "境": 737,
    "朋": 738,
    "友": 739,
    "聊": 740,
    "劳": 741,
    "逸": 742,
    "才": 743,
    "走": 744,
    "得": 745,
    "保": 746,
    "健": 747,
    "康": 748,
    "充": 749,
    "足": 750,
    "睡": 751,
    "眠": 752,
    "饮": 753,
    "食": 754,
    "吃": 755,
    "蔬": 756,
    "周": 757,
    "至": 758,
    "良": 759,
    "期": 760,
    "疾": 761,
    "病": 762,
    "熬": 763,
    "夜": 764,
    "久": 765,
    "坐": 766,
    "听": 767,
    "电": 768,
    "培": 769,
    "养": 770,
    "泡": 771,
    "澡": 772,
    "骤": 773,
    "奖": 774,
    "观": 775,
    "端": 776,
    "策": 777,
    "略": 778,
    "裁": 779,
    "剪": 780,
    "既": 781,
    "又": 782,
    "避": 783,
    "免": 784,
    "估": 785,
    "坏": 786,
    "指": 787,
    "导": 788,
    "状": 789,
    "仅": 790,
    "齐": 791,
    "拒": 792,
    "升": 793,
    "早": 794,
    "愉": 795,
    "晚": 796,
    "碌": 797,
    "该": 798,
    "先": 799,
    "微": 800,
    "框": 801,
    "践": 802,
    "灵": 803,
    "便": 804,
    "署": 805,
    "栈": 806,
    "针": 807,
    "继": 808,
    "翻": 809,
    "译": 810,
    "照": 811,
    "K": 812,
    "异": 813,
    "束": 814,
    "|": 815,
    "Σ": 816,
    "/": 817,
    "同": 818,
    "采": 819,
    "达": 820,
    "若": 821,
    "干": 822,
    "刚": 823,
    "<": 824,
    "尖": 825,
    "锐": 826,
    ">": 827,
    "温": 828,
    "严": 829,
    "肃": 830,
    "搜": 831,
    "索": 832,
    "留": 833,
    "扩": 834,
    "候": 835,
    "贪": 836,
    "维": 837,
    "国": 838,
    "男": 839,
    "女": 840,
    "≈": 841,
    "W": 842,
    "V": 843,
    "额": 844,
    "添": 845,
    "弦": 846,
    "余": 847,
    "嵌": 848,
    "掩": 849,
    "第": 850,
    "角": 851,
    "把": 852,
    "穷": 853,
    "×": 854,
    "旋": 855,
    "替": 856,
    "删": 857,
    "点": 858,
    "护": 859,
    "爆": 860,
    "炸": 861,
    ",": 862,
    "阈": 863,
    "缩": 864,
    "学习": 865,
    "什么": 866,
    "模型": 867,
    "什么是": 868,
    "训练": 869,
    "数据": 870,
    "一个": 871,
    "语言": 872,
    "or": 873,
    "AI": 874,
    "1.": 875,
    "2.": 876,
    "可以": 877,
    "梯度": 878,
    "3.": 879,
    "使用": 880,
    "语言模型": 881,
    "计算": 882,
    "Py": 883,
    "4.": 884,
    "建议": 885,
    "er": 886,
    "深度": 887,
    "深度学习": 888,
    "编程": 889,
    "on": 890,
    "基础": 891,
    "问题": 892,
    "帮助": 893,
    "我是": 894,
    "人类": 895,
    "th": 896,
    "函数": 897,
    "op": 898,
    "ch": 899,
    "5.": 900,
    "等于": 901,
    "是一": 902,
    "en": 903,
    "orm": 904,
    "常用": 905,
    "向量": 906,
    "at": 907,
    "技术": 908,
    "方法": 909,
    "代码": 910,
    "是一种": 911,
    "回答": 912,
    "位置": 913,
    "需要": 914,
    "概率": 915,
    "可能": 916,
    "适合": 917,
    "机器": 918,
    "机器学习": 919,
    "Pyth": 920,
    "Python": 921,
    "信息": 922,
    "an": 923,
    "生成": 924,
    "rop": 925,
    "分布": 926,
    "li": 927,
    "RL": 928,
    "RLH": 929,
    "RLHF": 930,
    "预训练": 931,
    "智能": 932,
    "如何": 933,
    "选择": 934,
    "神经": 935,
    "优化": 936,
    "学习率": 937,
    "未来": 938,
    "奖励": 939,
    "裁剪": 940,
    "人工": 941,
    "天气": 942,
    "能力": 943,
    "数学": 944,
    "我的": 945,
    "lo": 946,
    "网络": 947,
    "如果": 948,
    "通过": 949,
    "GP": 950,
    "有什么": 951,
    "ran": 952,
    "le": 953,
    "让模型": 954,
    "每个": 955,
    "重要": 956,
    "强化": 957,
    "强化学习": 958,
    "用于": 959,
    "损失": 960,
    "预测": 961,
    "in": 962,
    "ma": 963,
    "max": 964,
    "所有": 965,
    "任务": 966,
    "呼吸": 967,
    "tu": 968,
    "6.": 969,
    "专业": 970,
    "策略": 971,
    "采样": 972,
    "am": 973,
    "自己": 974,
    "小型": 975,
    "对话": 976,
    "应用": 977,
    "系统": 978,
    "神经网络": 979,
    "进行": 980,
    "大语言模型": 981,
    "提供": 982,
    "注意": 983,
    "注意力": 984,
    "连接": 985,
    "输出": 986,
    "拟合": 987,
    "损失函数": 988,
    "目标": 989,
    "算法": 990,
    "收敛": 991,
    "调试": 992,
    "的词": 993,
    "随机": 994,
    "防止": 995,
    "多少": 996,
    "会呼吸": 997,
    "9只": 998,
    "tup": 999,
    "tuple": 1000,
    "地球": 1001,
    "微调": 1002,
    "你好": 1003,
    "My": 1004,
    "MyL": 1005,
    "MyLL": 1006,
    "MyLLM": 1007,
    "开始": 1008,
    "人工智能": 1009,
    "的技术": 1010,
    "图像": 1011,
    "处理": 1012,
    "概念": 1013,
    "项目": 1014,
    "获取": 1015,
    "准确": 1016,
    "我可以": 1017,
    "简单": 1018,
    "程序": 1019,
    "因为": 1020,
    "推荐": 1021,
    "领域": 1022,
    "经典": 1023,
    "其他": 1024,
    "基于": 1025,
    "文本": 1026,
    "学会": 1027,
    "理解": 1028,
    "Tran": 1029,
    "Trans": 1030,
    "Transf": 1031,
    "Transform": 1032,
    "Transformer": 1033,
    "注意力机": 1034,
    "注意力机制": 1035,
    "序列": 1036,
    "输入": 1037,
    "然后": 1038,
    "助手": 1039,
    "过程": 1040,
    "过拟合": 1041,
    "Drop": 1042,
    "Dropo": 1043,
    "Dropou": 1044,
    "Dropout": 1045,
    "参数": 1046,
    "控制": 1047,
    "be": 1048,
    "空间": 1049,
    "距离": 1050,
    "of": 1051,
    "oft": 1052,
    "oftmax": 1053,
    "(x": 1054,
    "(x)": 1055,
    "它让": 1056,
    "成为": 1057,
    "La": 1058,
    "Lay": 1059,
    "Layer": 1060,
    "Norma": 1061,
    "Normali": 1062,
    "Normaliz": 1063,
    "Normalizat": 1064,
    "Normalizati": 1065,
    "Normalization": 1066,
    "归一": 1067,
    "归一化": 1068,
    "解释": 1069,
    "的编程": 1070,
    "希望": 1071,
    "10": 1072,
    "质数": 1073,
    "例如": 1074,
    "都是": 1075,
    "动物": 1076,
    "lis": 1077,
    "list": 1078,
    "你的": 1079,
    "it": 1080,
    "偏好": 1081,
    "具体": 1082,
    "奖励模型": 1083,
    "上好": 1084,
    "PyT": 1085,
    "PyTor": 1086,
    "PyTorch": 1087,
    "KL": 1088,
    "atch": 1089,
    "一下": 1090,
    "小型语言模型": 1091,
    "训练的": 1092,
    "但我": 1093,
    "包括": 1094,
    "等方法": 1095,
    "识别": 1096,
    "知识": 1097,
    "怎么": 1098,
    "没有": 1099,
    "一些": 1100,
    "简单的": 1101,
    "对于": 1102,
    "讲一个": 1103,
    "为什么": 1104,
    "25": 1105,
    "1等于": 1106,
    "low": 1107,
    "这是": 1108,
    "的基础": 1109,
    "喜欢": 1110,
    "作为": 1111,
    "设计": 1112,
    "人们": 1113,
    "看到": 1114,
    "反馈": 1115,
    "GPT": 1116,
    "由于": 1117,
    "20": 1118,
    "相关": 1119,
    "它计算": 1120,
    "求和": 1121,
    "循环": 1122,
    "你是": 1123,
    "你是谁": 1124,
    "规律": 1125,
    "监督": 1126,
    "区别": 1127,
    "多层": 1128,
    "特征": 1129,
    "组成": 1130,
    "权重": 1131,
    "调整": 1132,
    "GPU": 1133,
    "加速": 1134,
    "数据上": 1135,
    "方向": 1136,
    "更新": 1137,
    "逐步": 1138,
    "ok": 1139,
    "oken": 1140,
    "常用的": 1141,
    "激活": 1142,
    "概率分布": 1143,
    "残差": 1144,
    "残差连接": 1145,
    "直接": 1146,
    "梯度消": 1147,
    "梯度消失": 1148,
    "分布更": 1149,
    "稳定": 1150,
    "方式": 1151,
    "统计": 1152,
    "你有": 1153,
    "等于多少": 1154,
    "只能": 1155,
    "自身": 1156,
    "所有猫": 1157,
    "都会呼吸": 1158,
    "for": 1159,
    "执行": 1160,
    "的数据": 1161,
    "递归": 1162,
    "情况": 1163,
    "休息": 1164,
    "AP": 1165,
    "API": 1166,
    "核心": 1167,
    "阳光": 1168,
    "蚂蚁": 1169,
    "地球到": 1170,
    "地球到月": 1171,
    "地球到月球": 1172,
    "的平": 1173,
    "万公": 1174,
    "万公里": 1175,
    "0.": 1176,
    "太阳": 1177,
    "行星": 1178,
    "王星": 1179,
    "天空": 1180,
    "蓝色": 1181,
    "散射": 1182,
    "₂O": 1183,
    "的过程": 1184,
    "我不": 1185,
    "安全": 1186,
    "伤害": 1187,
    "特定": 1188,
    "场景": 1189,
    "Op": 1190,
    "Open": 1191,
    "OpenAI": 1192,
    "An": 1193,
    "Anth": 1194,
    "Anthrop": 1195,
    "Anthropi": 1196,
    "Anthropic": 1197,
    "放松": 1198,
    "保持": 1199,
    "的方法": 1200,
    "人类偏好": 1201,
    "PP": 1202,
    "PPO": 1203,
    "限制": 1204,
    "的一": 1205,
    "适应": 1206,
    "SF": 1207,
    "SFT": 1208,
    "散度": 1209,
    "op-": 1210,
    "位置编": 1211,
    "位置编码": 1212,
    "掩码": 1213,
    "数据增": 1214,
    "数据增强": 1215,
    "Ad": 1216,
    "Adam": 1217,
    "优化器": 1218,
    "梯度裁剪": 1219,
    "介绍": 1220,
    "一个小型语言模型": 1221,
    "规模": 1222,
    "正在": 1223,
    "让计算": 1224,
    "让计算机": 1225,
    "它包括": 1226,
    "实现": 1227,
    "语音": 1228,
    "自然": 1229,
    "功能": 1230,
    "学习编程": 1231,
    "学习基础": 1232,
    "学习基础语": 1233,
    "学习基础语法": 1234,
    "动手": 1235,
    "写代码": 1236,
    "练习": 1237,
    "做小": 1238,
    "巩固": 1239,
    "抱歉": 1240,
    "我无": 1241,
    "我无法": 1242,
    "天气信息": 1243,
    "你会": 1244,
    "数学题": 1245,
    "我可以尝": 1246,
    "我可以尝试": 1247,
    "计算能力": 1248,
    "有限": 1249,
    "复杂": 1250,
    "的计算": 1251,
    "建议使用": 1252,
    "软件": 1253,
    "好的": 1254,
    "是分": 1255,
    "ec": 1256,
    "进制": 1257,
    "进制的": 1258,
    "本书": 1259,
    "Go": 1260,
    "Goo": 1261,
    "和深度学习": 1262,
    "的基础知识": 1263,
    "被设计": 1264,
    "被设计来": 1265,
    "帮助人们": 1266,
    "进行对话": 1267,
    "1+": 1268,
    "1+1等于": 1269,
    "运算": 1270,
    "可以问": 1271,
    "可以问我": 1272,
    "回答问题": 1273,
    "小型模型": 1274,
    "帮助你": 1275,
    "架构": 1276,
    "17": 1277,
    "它使用": 1278,
    "关注": 1279,
    "中最": 1280,
    "它计算每个": 1281,
    "位置的": 1282,
    "相关性": 1283,
    "根据": 1284,
    "重要信息": 1285,
    "变量": 1286,
    "实际": 1287,
    "实际项目": 1288,
    "阅读": 1289,
    "他人": 1290,
    "创造": 1291,
    "教学": 1292,
    "教学演": 1293,
    "教学演示": 1294,
    "教学演示用": 1295,
    "教学演示用的": 1296,
    "工作": 1297,
    "分支": 1298,
    "数据中": 1299,
    "数据中学习": 1300,
    "而不": 1301,
    "监督学习": 1302,
    "有什么区别": 1303,
    "是机器学习": 1304,
    "自动": 1305,
    "NL": 1306,
    "NLP": 1307,
    "显著": 1308,
    "结构": 1309,
    "神经元": 1310,
    "最终": 1311,
    "矩阵": 1312,
    "模型在": 1313,
    "数据上表": 1314,
    "数据上表现": 1315,
    "差的": 1316,
    "用正": 1317,
    "则化": 1318,
    "增加": 1319,
    "增加数据": 1320,
    "缓解": 1321,
    "衡量": 1322,
    "的差": 1323,
    "目标是": 1324,
    "目标是最": 1325,
    "小化": 1326,
    "小化损失函数": 1327,
    "常见": 1328,
    "回归": 1329,
    "分类": 1330,
    "梯度下": 1331,
    "梯度下降": 1332,
    "找到": 1333,
    "最优": 1334,
    "太大": 1335,
    "通常": 1336,
    "Token": 1337,
    "Tokeni": 1338,
    "Tokeniz": 1339,
    "Tokenizer": 1340,
    "词级": 1341,
    "词表": 1342,
    "语义": 1343,
    "Em": 1344,
    "Embe": 1345,
    "Embed": 1346,
    "Embedd": 1347,
    "Embeddin": 1348,
    "Embedding": 1349,
    "是将": 1350,
    "向量的技术": 1351,
    "相似": 1352,
    "相似的词": 1353,
    "相似的词在": 1354,
    "相似的词在向量": 1355,
    "相似的词在向量空间": 1356,
    "相似的词在向量空间中": 1357,
    "相似的词在向量空间中距离": 1358,
    "相似的词在向量空间中距离较": 1359,
    "相似的词在向量空间中距离较近": 1360,
    "Softmax": 1361,
    "激活函数": 1362,
    "转换": 1363,
    "元素": 1364,
    "之间": 1365,
    "的输出": 1366,
    "某些": 1367,
    "减轻": 1368,
    "减轻过拟合": 1369,
    "推理": 1370,
    "成为可能": 1371,
    "进行归一化": 1372,
    "数值": 1373,
    "样本": 1374,
    "均值": 1375,
    "方差": 1376,
    "标准": 1377,
    "加速训练": 1378,
    "加速训练收敛": 1379,
    "你能": 1380,
    "帮你": 1381,
    "取代": 1382,
    "取代人类": 1383,
    "高效": 1384,
    "改变": 1385,
    "很难": 1386,
    "协作": 1387,
    "可能的": 1388,
    "工程": 1389,
    "工程师": 1390,
    "数学基础": 1391,
    "线性": 1392,
    "线性代": 1393,
    "线性代数": 1394,
    "持续": 1395,
    "持续学习": 1396,
    "犯错": 1397,
    "是的": 1398,
    "我是基于": 1399,
    "不准确": 1400,
    "或不": 1401,
    "合理": 1402,
    "内容": 1403,
    "我的回答": 1404,
    "再见": 1405,
    "交流": 1406,
    "2+": 1407,
    "2+3": 1408,
    "5乘": 1409,
    "5乘以": 1410,
    "5乘以6": 1411,
    "是多少": 1412,
    "等于3": 1413,
    "100": 1414,
    "100除": 1415,
    "100除以": 1416,
    "100除以4": 1417,
    "所有猫都是": 1418,
    "所有猫都是动物": 1419,
    "所有动物": 1420,
    "所有动物都会呼吸": 1421,
    "猫会呼吸": 1422,
    "前提": 1423,
    "除了": 1424,
    "除了9只": 1425,
    "除了9只以": 1426,
    "除了9只以外": 1427,
    "除了9只以外都": 1428,
    "除了9只以外都跑": 1429,
    "除了9只以外都跑了": 1430,
    "还剩": 1431,
    "所以": 1432,
    "解释一下": 1433,
    "解释一下什么是": 1434,
    "中的": 1435,
    "重复": 1436,
    "ge": 1437,
    "pr": 1438,
    "prin": 1439,
    "print": 1440,
    "可变": 1441,
    "括号": 1442,
    "调用": 1443,
    "调用自身": 1444,
    "基本": 1445,
    "基本情况": 1446,
    "条件": 1447,
    "-1": 1448,
    "换个": 1449,
    "组件": 1450,
    "交互": 1451,
    "定义": 1452,
    "请求": 1453,
    "和数据": 1454,
    "格式": 1455,
    "了解": 1456,
    "Git": 1457,
    "是什么": 1458,
    "核心概念": 1459,
    "om": 1460,
    "团队": 1461,
    "帮我": 1462,
    "对联": 1463,
    "上联": 1464,
    "书山": 1465,
    "书山有": 1466,
    "书山有路": 1467,
    "书山有路勤": 1468,
    "书山有路勤为": 1469,
    "书山有路勤为径": 1470,
    "相对": 1471,
    "相对论": 1472,
    "速度": 1473,
    "时间": 1474,
    "引力": 1475,
    "质量": 1476,
    "质量和": 1477,
    "能量": 1478,
    "小蚂蚁": 1479,
    "成功": 1480,
    "告诉": 1481,
    "告诉我": 1482,
    "坚持": 1483,
    "约3": 1484,
    "这个": 1485,
    "变化": 1486,
    "光从": 1487,
    "太阳系": 1488,
    "太阳系有": 1489,
    "颗行星": 1490,
    "是蓝色": 1491,
    "是蓝色的": 1492,
    "包含": 1493,
    "更容": 1494,
    "更容易": 1495,
    "分子": 1496,
    "水是": 1497,
    "和氧": 1498,
    "H₂O": 1499,
    "两个": 1500,
    "原子": 1501,
    "光合": 1502,
    "光合作": 1503,
    "光合作用": 1504,
    "公式": 1505,
    "O₂": 1506,
    "违法": 1507,
    "的事": 1508,
    "的事情": 1509,
    "我不能": 1510,
    "任何": 1511,
    "趋势": 1512,
    "推测": 1513,
    "专业的": 1514,
    "研究": 1515,
    "取决": 1516,
    "取决于": 1517,
    "你的需": 1518,
    "你的需求和": 1519,
    "自己的": 1520,
    "兴趣": 1521,
    "不要": 1522,
    "最重要": 1523,
    "比较": 1524,
    "厉害": 1525,
    "优秀": 1526,
    "哪个": 1527,
    "具体应用": 1528,
    "具体应用场景": 1529,
    "想学习": 1530,
    "正常": 1531,
    "环境": 1532,
    "和朋": 1533,
    "和朋友": 1534,
    "和朋友聊": 1535,
    "结合": 1536,
    "保持健": 1537,
    "保持健康": 1538,
    "保证": 1539,
    "运动": 1540,
    "是训练": 1541,
    "步骤": 1542,
    "回答给": 1543,
    "智能体": 1544,
    "状态": 1545,
    "动作": 1546,
    "累积": 1547,
    "难以": 1548,
    "让模型学会": 1549,
    "提升": 1550,
    "早上好": 1551,
    "的一天": 1552,
    "晚上好": 1553,
    "Ten": 1554,
    "Tens": 1555,
    "Tensor": 1556,
    "TensorF": 1557,
    "TensorFlow": 1558,
    "更灵": 1559,
    "更灵活": 1560,
    "界常用": 1561,
    "是在": 1562,
    "标注": 1563,
    "特定任务": 1564,
    "继续": 1565,
    "(P": 1566,
    "log": 1567,
    "为0": 1568,
    "top-": 1569,
    "0.9": 1570,
    "选择概率": 1571,
    "选择概率最": 1572,
    "选择概率最高": 1573,
    "选择概率最高的": 1574,
    "超过": 1575,
    "它比": 1576,
    "不同": 1577,
    "em": 1578,
    "emp": 1579,
    "emper": 1580,
    "emperatu": 1581,
    "emperatur": 1582,
    "emperature": 1583,
    "softmax": 1584,
    "让分布更": 1585,
    "温度": 1586,
    "温度适合": 1587,
    "beam": 1588,
    "se": 1589,
    "sea": 1590,
    "sear": 1591,
    "search": 1592,
    "搜索": 1593,
    "词向量": 1594,
    "维度": 1595,
    "现代": 1596,
    "现代模型": 1597,
    "添加": 1598,
    "因果": 1599,
    "因果掩码": 1600,
    "个词": 1601,
    "10减": 1602,
    "10减7": 1603,
    "3的平": 1604,
    "3的平方": 1605,
    "批量": 1606,
    "批量归一化": 1607,
    "Batch": 1608,
    "batch": 1609,
    "阶矩": 1610,
    "防止梯度消失": 1611,
    "Norm": 1612,
    "RN": 1613,
    "RNN": 1614,
    "范数": 1615,
    "请介绍": 1616,
    "请介绍一下": 1617,
    "请介绍一下自己": 1618,
    "我是从": 1619,
    "我是从零": 1620,
    "我是从零开始": 1621,
    "我是从零开始训练的": 1622,
    "虽然": 1623,
    "虽然规模": 1624,
    "虽然规模很": 1625,
    "虽然规模很小": 1626,
    "但我正在": 1627,
    "但我正在努": 1628,
    "但我正在努力": 1629,
    "但我正在努力学习": 1630,
    "但我正在努力学习中": 1631,
    "但我正在努力学习中文": 1632,
    "但我正在努力学习中文对话": 1633,
    "什么是人工智能": 1634,
    "人工智能是": 1635,
    "人工智能是让计算机": 1636,
    "人工智能是让计算机模": 1637,
    "人工智能是让计算机模拟": 1638,
    "人工智能是让计算机模拟人类": 1639,
    "人工智能是让计算机模拟人类智能": 1640,
    "人工智能是让计算机模拟人类智能的技术": 1641,
    "它包括机器学习": 1642,
    "深度学习等方法": 1643,
    "可以实现": 1644,
    "可以实现图像": 1645,
    "可以实现图像识别": 1646,
    "语音识别": 1647,
    "自然语言": 1648,
    "自然语言处理": 1649,
    "自然语言处理等": 1650,
    "自然语言处理等功能": 1651,
    "如何学习编程": 1652,
    "学习编程可以": 1653,
    "学习编程可以从": 1654,
    "学习编程可以从以": 1655,
    "学习编程可以从以下": 1656,
    "学习编程可以从以下几": 1657,
    "学习编程可以从以下几步": 1658,
    "学习编程可以从以下几步开始": 1659,
    "选择一": 1660,
    "选择一门": 1661,
    "选择一门入": 1662,
    "选择一门入门": 1663,
    "选择一门入门语言": 1664,
    "学习基础语法和": 1665,
    "学习基础语法和概念": 1666,
    "多动手": 1667,
    "多动手写代码": 1668,
    "多动手写代码练习": 1669,
    "做小项目": 1670,
    "做小项目巩固": 1671,
    "做小项目巩固知识": 1672,
    "遇到": 1673,
    "遇到问题": 1674,
    "遇到问题多": 1675,
    "遇到问题多查": 1676,
    "遇到问题多查资": 1677,
    "遇到问题多查资料": 1678,
    "多思": 1679,
    "多思考": 1680,
    "今天": 1681,
    "今天天气": 1682,
    "今天天气怎么": 1683,
    "今天天气怎么样": 1684,
    "我无法获取": 1685,
    "我无法获取实": 1686,
    "我无法获取实时": 1687,
    "我无法获取实时天气信息": 1688,
    "我是一个语言模型": 1689,
    "没有联": 1690,
    "没有联网": 1691,
    "没有联网能力": 1692,
    "建议你": 1693,
    "建议你查": 1694,
    "建议你查看": 1695,
    "建议你查看天气": 1696,
    "建议你查看天气预": 1697,
    "建议你查看天气预报": 1698,
    "建议你查看天气预报应用": 1699,
    "建议你查看天气预报应用或": 1700,
    "建议你查看天气预报应用或网": 1701,
    "建议你查看天气预报应用或网站": 1702,
    "建议你查看天气预报应用或网站获取": 1703,
    "建议你查看天气预报应用或网站获取准确": 1704,
    "建议你查看天气预报应用或网站获取准确的": 1705,
    "建议你查看天气预报应用或网站获取准确的天气信息": 1706,
    "你会做": 1707,
    "你会做数学题": 1708,
    "你会做数学题吗": 1709,
    "我可以尝试做": 1710,
    "我可以尝试做一些": 1711,
    "我可以尝试做一些简单的": 1712,
    "我可以尝试做一些简单的数学题": 1713,
    "但我的计算能力有限": 1714,
    "对于复杂": 1715,
    "对于复杂的计算": 1716,
    "建议使用计算": 1717,
    "建议使用计算器": 1718,
    "建议使用计算器或": 1719,
    "建议使用计算器或数学": 1720,
    "建议使用计算器或数学软件": 1721,
    "建议使用计算器或数学软件会": 1722,
    "建议使用计算器或数学软件会更": 1723,
    "建议使用计算器或数学软件会更准确": 1724,
    "讲一个笑": 1725,
    "讲一个笑话": 1726,
    "给你": 1727,
    "给你讲一个": 1728,
    "为什么程序": 1729,
    "为什么程序员": 1730,
    "为什么程序员总": 1731,
    "为什么程序员总是分": 1732,
    "为什么程序员总是分不": 1733,
    "为什么程序员总是分不清": 1734,
    "为什么程序员总是分不清万": 1735,
    "为什么程序员总是分不清万圣": 1736,
    "为什么程序员总是分不清万圣节": 1737,
    "为什么程序员总是分不清万圣节和": 1738,
    "为什么程序员总是分不清万圣节和圣": 1739,
    "为什么程序员总是分不清万圣节和圣诞": 1740,
    "为什么程序员总是分不清万圣节和圣诞节": 1741,
    "Oc": 1742,
    "Oct": 1743,
    "31": 1744,
    "Dec": 1745,
    "八进制的": 1746,
    "八进制的31等于": 1747,
    "八进制的31等于十": 1748,
    "八进制的31等于十进制的": 1749,
    "八进制的31等于十进制的25": 1750,
    "推荐一": 1751,
    "推荐一本书": 1752,
    "我推荐": 1753,
    "我推荐《": 1754,
    "我推荐《深度学习": 1755,
    "我推荐《深度学习》": 1756,
    "我推荐《深度学习》这": 1757,
    "我推荐《深度学习》这本书": 1758,
    "作者": 1759,
    "作者是": 1760,
    "Ian": 1761,
    "Good": 1762,
    "Goodf": 1763,
    "Goodfe": 1764,
    "Goodfel": 1765,
    "Goodfellow": 1766,
    "等人": 1767,
    "这是深度学习": 1768,
    "这是深度学习领域": 1769,
    "这是深度学习领域的": 1770,
    "这是深度学习领域的经典": 1771,
    "这是深度学习领域的经典教": 1772,
    "这是深度学习领域的经典教材": 1773,
    "系统地": 1774,
    "系统地介绍": 1775,
    "系统地介绍了": 1776,
    "系统地介绍了神经网络": 1777,
    "系统地介绍了神经网络和深度学习": 1778,
    "系统地介绍了神经网络和深度学习的基础知识": 1779,
    "你喜欢": 1780,
    "你喜欢什么": 1781,
    "作为一个": 1782,
    "我没有": 1783,
    "我没有真": 1784,
    "我没有真正": 1785,
    "我没有真正的": 1786,
    "我没有真正的喜": 1787,
    "我没有真正的喜好": 1788,
    "但我被设计来": 1789,
    "但我被设计来帮助人们": 1790,
    "但我被设计来帮助人们解": 1791,
    "但我被设计来帮助人们解答": 1792,
    "但我被设计来帮助人们解答问题": 1793,
    "但我被设计来帮助人们解答问题和": 1794,
    "但我被设计来帮助人们解答问题和进行对话": 1795,
    "这是我的": 1796,
    "使命": 1797,
    "我喜欢": 1798,
    "我喜欢看到": 1799,
    "我喜欢看到用": 1800,
    "我喜欢看到用户": 1801,
    "我喜欢看到用户满": 1802,
    "我喜欢看到用户满意": 1803,
    "我喜欢看到用户满意的": 1804,
    "我喜欢看到用户满意的反馈": 1805,
    "1+1等于几": 1806,
    "1+1等于2": 1807,
    "这是最": 1808,
    "这是最基础": 1809,
    "这是最基础的": 1810,
    "这是最基础的数学": 1811,
    "这是最基础的数学运算": 1812,
    "谢谢": 1813,
    "谢谢你": 1814,
    "不客": 1815,
    "不客气": 1816,
    "很高": 1817,
    "很高兴": 1818,
    "很高兴能": 1819,
    "很高兴能帮": 1820,
    "很高兴能帮到": 1821,
    "很高兴能帮到你": 1822,
    "如果还": 1823,
    "如果还有": 1824,
    "如果还有其他": 1825,
    "如果还有其他问题": 1826,
    "随时": 1827,
    "随时可以问我": 1828,
    "什么是大语言模型": 1829,
    "大语言模型是一种": 1830,
    "大语言模型是一种基于": 1831,
    "大语言模型是一种基于深度学习": 1832,
    "大语言模型是一种基于深度学习的": 1833,
    "通过在": 1834,
    "通过在海": 1835,
    "通过在海量": 1836,
    "通过在海量文本": 1837,
    "通过在海量文本上": 1838,
    "通过在海量文本上训练": 1839,
    "学会理解": 1840,
    "学会理解和": 1841,
    "学会理解和生成": 1842,
    "学会理解和生成人类": 1843,
    "学会理解和生成人类语言": 1844,
    "著名": 1845,
    "著名的": 1846,
    "著名的大语言模型": 1847,
    "著名的大语言模型包括": 1848,
    "Cl": 1849,
    "Cla": 1850,
    "Clau": 1851,
    "Claud": 1852,
    "Claude": 1853,
    "Qw": 1854,
    "Qwen": 1855,
    "你有什么功能": 1856,
    "我可以进行对话": 1857,
    "提供建议": 1858,
    "提供建议等": 1859,
    "由于我是一个": 1860,
    "由于我是一个小型模型": 1861,
    "能力有限": 1862,
    "但我会": 1863,
    "但我会尽": 1864,
    "但我会尽力": 1865,
    "但我会尽力帮助你": 1866,
    "是一种神经网络": 1867,
    "是一种神经网络架构": 1868,
    "Goog": 1869,
    "Google": 1870,
    "2017": 1871,
    "年提": 1872,
    "年提出": 1873,
    "它使用注意力机制": 1874,
    "它使用注意力机制处理": 1875,
    "它使用注意力机制处理序列": 1876,
    "它使用注意力机制处理序列数据": 1877,
    "BE": 1878,
    "BER": 1879,
    "BERT": 1880,
    "等大": 1881,
    "等大模型": 1882,
    "等大模型的基础": 1883,
    "等大模型的基础架构": 1884,
    "什么是注意力机制": 1885,
    "注意力机制让模型": 1886,
    "注意力机制让模型能": 1887,
    "注意力机制让模型能够": 1888,
    "注意力机制让模型能够关注": 1889,
    "注意力机制让模型能够关注输入": 1890,
    "注意力机制让模型能够关注输入中最": 1891,
    "注意力机制让模型能够关注输入中最相关": 1892,
    "注意力机制让模型能够关注输入中最相关的": 1893,
    "注意力机制让模型能够关注输入中最相关的部": 1894,
    "注意力机制让模型能够关注输入中最相关的部分": 1895,
    "它计算每个位置": 1896,
    "它计算每个位置与": 1897,
    "它计算每个位置与其他": 1898,
    "它计算每个位置与其他位置的": 1899,
    "它计算每个位置与其他位置的相关性": 1900,
    "然后根据": 1901,
    "然后根据相关性": 1902,
    "然后根据相关性加": 1903,
    "然后根据相关性加权": 1904,
    "然后根据相关性加权求和": 1905,
    "获取重要信息": 1906,
    "怎么学": 1907,
    "做小练习": 1908,
    "做小练习巩固": 1909,
    "学习常用": 1910,
    "学习常用库": 1911,
    "学习常用库如": 1912,
    "Nu": 1913,
    "Num": 1914,
    "NumPy": 1915,
    "Pan": 1916,
    "Pand": 1917,
    "Panda": 1918,
    "Pandas": 1919,
    "实际项目练": 1920,
    "实际项目练手": 1921,
    "阅读他人": 1922,
    "阅读他人代码": 1923,
    "阅读他人代码学习": 1924,
    "你是谁创造": 1925,
    "你是谁创造的": 1926,
    "一个教学演示用的": 1927,
    "一个教学演示用的小型语言模型": 1928,
    "我的代码": 1929,
    "我的代码是": 1930,
    "我的代码是为": 1931,
    "我的代码是为了": 1932,
    "我的代码是为了帮助人们": 1933,
    "我的代码是为了帮助人们理解": 1934,
    "我的代码是为了帮助人们理解大语言模型": 1935,
    "我的代码是为了帮助人们理解大语言模型的": 1936,
    "我的代码是为了帮助人们理解大语言模型的工作": 1937,
    "我的代码是为了帮助人们理解大语言模型的工作原": 1938,
    "我的代码是为了帮助人们理解大语言模型的工作原理": 1939,
    "我的代码是为了帮助人们理解大语言模型的工作原理而": 1940,
    "我的代码是为了帮助人们理解大语言模型的工作原理而编": 1941,
    "我的代码是为了帮助人们理解大语言模型的工作原理而编写": 1942,
    "我的代码是为了帮助人们理解大语言模型的工作原理而编写的": 1943,
    "你是谁?": 1944,
    "我是MyLLM": 1945,
    "机器学习是": 1946,
    "机器学习是人工智能": 1947,
    "机器学习是人工智能的一个": 1948,
    "机器学习是人工智能的一个分支": 1949,
    "让计算机从": 1950,
    "让计算机从数据中学习": 1951,
    "让计算机从数据中学习规律": 1952,
    "而不需要": 1953,
    "而不需要明": 1954,
    "而不需要明确": 1955,
    "而不需要明确编程": 1956,
    "它包括监督学习": 1957,
    "无监督学习": 1958,
    "强化学习等方法": 1959,
    "深度学习和": 1960,
    "深度学习和机器学习": 1961,
    "深度学习和机器学习有什么区别": 1962,
    "深度学习是机器学习": 1963,
    "深度学习是机器学习的一个": 1964,
    "深度学习是机器学习的一个子": 1965,
    "深度学习是机器学习的一个子集": 1966,
    "它使用多层": 1967,
    "它使用多层神经网络": 1968,
    "它使用多层神经网络自动": 1969,
    "它使用多层神经网络自动学习": 1970,
    "它使用多层神经网络自动学习特征": 1971,
    "不需要": 1972,
    "不需要人工": 1973,
    "不需要人工设计": 1974,
    "不需要人工设计特征": 1975,
    "深度学习在": 1976,
    "深度学习在图像": 1977,
    "等领域": 1978,
    "等领域效": 1979,
    "等领域效果": 1980,
    "等领域效果显著": 1981,
    "什么是神经网络": 1982,
    "神经网络是一种": 1983,
    "神经网络是一种模": 1984,
    "神经网络是一种模仿": 1985,
    "神经网络是一种模仿人": 1986,
    "神经网络是一种模仿人脑": 1987,
    "神经网络是一种模仿人脑结构": 1988,
    "神经网络是一种模仿人脑结构的计算": 1989,
    "神经网络是一种模仿人脑结构的计算模型": 1990,
    "它由": 1991,
    "它由多层": 1992,
    "它由多层神经元": 1993,
    "它由多层神经元组成": 1994,
    "通过权重": 1995,
    "通过权重连接": 1996,
    "输入数据": 1997,
    "输入数据经": 1998,
    "输入数据经过": 1999
  },
  "merges": [
    [
      "学",
      "习"
    ],
    [
      "什",
      "么"
    ],
    [
      "模",
      "型"
    ],
    [
      "什么",
      "是"
    ],
    [
      "训",
      "练"
    ],
    [
      "数",
      "据"
    ],
    [
      "一",
      "个"
    ],
    [
      "语",
      "言"
    ],
    [
      "o",
      "r"
    ],
    [
      "A",
      "I"
    ],
    [
      "1",
      "."
    ],
    [
      "2",
      "."
    ],
    [
      "可",
      "以"
    ],
    [
      "梯",
      "度"
    ],
    [
      "3",
      "."
    ],
    [
      "使",
      "用"
    ],
    [
      "语言",
      "模型"
    ],
    [
      "计",
      "算"
    ],
    [
      "P",
      "y"
    ],
    [
      "4",
      "."
    ],
    [
      "建",
      "议"
    ],
    [
      "e",
      "r"
    ],
    [
      "深",
      "度"
    ],
    [
      "深度",
      "学习"
    ],
    [
      "编",
      "程"
    ],
    [
      "o",
      "n"
    ],
    [
      "基",
      "础"
    ],
    [
      "问",
      "题"
    ],
    [
      "帮",
      "助"
    ],
    [
      "我",
      "是"
    ],
    [
      "人",
      "类"
    ],
    [
      "t",
      "h"
    ],
    [
      "函",
      "数"
    ],
    [
      "o",
      "p"
    ],
    [
      "c",
      "h"
    ],
    [
      "5",
      "."
    ],
    [
      "等",
      "于"
    ],
    [
      "是",
      "一"
    ],
    [
      "e",
      "n"
    ],
    [
      "or",
      "m"
    ],
    [
      "常",
      "用"
    ],
    [
      "向",
      "量"
    ],
    [
      "a",
      "t"
    ],
    [
      "技",
      "术"
    ],
    [
      "方",
      "法"
    ],
    [
      "代",
      "码"
    ],
    [
      "是一",
      "种"
    ],
    [
      "回",
      "答"
    ],
    [
      "位",
      "置"
    ],
    [
      "需",
      "要"
    ],
    [
      "概",
      "率"
    ],
    [
      "可",
      "能"
    ],
    [
      "适",
      "合"
    ],
    [
      "机",
      "器"
    ],
    [
      "机器",
      "学习"
    ],
    [
      "Py",
      "th"
    ],
    [
      "Pyth",
      "on"
    ],
    [
      "信",
      "息"
    ],
    [
      "a",
      "n"
    ],
    [
      "生",
      "成"
    ],
    [
      "r",
      "op"
    ],
    [
      "分",
      "布"
    ],
    [
      "l",
      "i"
    ],
    [
      "R",
      "L"
    ],
    [
      "RL",
      "H"
    ],
    [
      "RLH",
      "F"
    ],
    [
      "预",
      "训练"
    ],
    [
      "智",
      "能"
    ],
    [
      "如",
      "何"
    ],
    [
      "选",
      "择"
    ],
    [
      "神",
      "经"
    ],
    [
      "优",
      "化"
    ],
    [
      "学习",
      "率"
    ],
    [
      "未",
      "来"
    ],
    [
      "奖",
      "励"
    ],
    [
      "裁",
      "剪"
    ],
    [
      "人",
      "工"
    ],
    [
      "天",
      "气"
    ],
    [
      "能",
      "力"
    ],
    [
      "数",
      "学"
    ],
    [
      "我",
      "的"
    ],
    [
      "l",
      "o"
    ],
    [
      "网",
      "络"
    ],
    [
      "如",
      "果"
    ],
    [
      "通",
      "过"
    ],
    [
      "G",
      "P"
    ],
    [
      "有",
      "什么"
    ],
    [
      "r",
      "an"
    ],
    [
      "l",
      "e"
    ],
    [
      "让",
      "模型"
    ],
    [
      "每",
      "个"
    ],
    [
      "重",
      "要"
    ],
    [
      "强",
      "化"
    ],
    [
      "强化",
      "学习"
    ],
    [
      "用",
      "于"
    ],
    [
      "损",
      "失"
    ],
    [
      "预",
      "测"
    ],
    [
      "i",
      "n"
    ],
    [
      "m",
      "a"
    ],
    [
      "ma",
      "x"
    ],
    [
      "所",
      "有"
    ],
    [
      "任",
      "务"
    ],
    [
      "呼",
      "吸"
    ],
    [
      "t",
      "u"
    ],
    [
      "6",
      "."
    ],
    [
      "专",
      "业"
    ],
    [
      "策",
      "略"
    ],
    [
      "采",
      "样"
    ],
    [
      "a",
      "m"
    ],
    [
      "自",
      "己"
    ],
    [
      "小",
      "型"
    ],
    [
      "对",
      "话"
    ],
    [
      "应",
      "用"
    ],
    [
      "系",
      "统"
    ],
    [
      "神经",
      "网络"
    ],
    [
      "进",
      "行"
    ],
    [
      "大",
      "语言模型"
    ],
    [
      "提",
      "供"
    ],
    [
      "注",
      "意"
    ],
    [
      "注意",
      "力"
    ],
    [
      "连",
      "接"
    ],
    [
      "输",
      "出"
    ],
    [
      "拟",
      "合"
    ],
    [
      "损失",
      "函数"
    ],
    [
      "目",
      "标"
    ],
    [
      "算",
      "法"
    ],
    [
      "收",
      "敛"
    ],
    [
      "调",
      "试"
    ],
    [
      "的",
      "词"
    ],
    [
      "随",
      "机"
    ],
    [
      "防",
      "止"
    ],
    [
      "多",
      "少"
    ],
    [
      "会",
      "呼吸"
    ],
    [
      "9",
      "只"
    ],
    [
      "tu",
      "p"
    ],
    [
      "tup",
      "le"
    ],
    [
      "地",
      "球"
    ],
    [
      "微",
      "调"
    ],
    [
      "你",
      "好"
    ],
    [
      "M",
      "y"
    ],
    [
      "My",
      "L"
    ],
    [
      "MyL",
      "L"
    ],
    [
      "MyLL",
      "M"
    ],
    [
      "开",
      "始"
    ],
    [
      "人工",
      "智能"
    ],
    [
      "的",
      "技术"
    ],
    [
      "图",
      "像"
    ],
    [
      "处",
      "理"
    ],
    [
      "概",
      "念"
    ],
    [
      "项",
      "目"
    ],
    [
      "获",
      "取"
    ],
    [
      "准",
      "确"
    ],
    [
      "我",
      "可以"
    ],
    [
      "简",
      "单"
    ],
    [
      "程",
      "序"
    ],
    [
      "因",
      "为"
    ],
    [
      "推",
      "荐"
    ],
    [
      "领",
      "域"
    ],
    [
      "经",
      "典"
    ],
    [
      "其",
      "他"
    ],
    [
      "基",
      "于"
    ],
    [
      "文",
      "本"
    ],
    [
      "学",
      "会"
    ],
    [
      "理",
      "解"
    ],
    [
      "T",
      "ran"
    ],
    [
      "Tran",
      "s"
    ],
    [
      "Trans",
      "f"
    ],
    [
      "Transf",
      "orm"
    ],
    [
      "Transform",
      "er"
    ],
    [
      "注意力",
      "机"
    ],
    [
      "注意力机",
      "制"
    ],
    [
      "序",
      "列"
    ],
    [
      "输",
      "入"
    ],
    [
      "然",
      "后"
    ],
    [
      "助",
      "手"
    ],
    [
      "过",
      "程"
    ],
    [
      "过",
      "拟合"
    ],
    [
      "D",
      "rop"
    ],
    [
      "Drop",
      "o"
    ],
    [
      "Dropo",
      "u"
    ],
    [
      "Dropou",
      "t"
    ],
    [
      "参",
      "数"
    ],
    [
      "控",
      "制"
    ],
    [
      "b",
      "e"
    ],
    [
      "空",
      "间"
    ],
    [
      "距",
      "离"
    ],
    [
      "o",
      "f"
    ],
    [
      "of",
      "t"
    ],
    [
      "oft",
      "max"
    ],
    [
      "(",
      "x"
    ],
    [
      "(x",
      ")"
    ],
    [
      "它",
      "让"
    ],
    [
      "成",
      "为"
    ],
    [
      "L",
      "a"
    ],
    [
      "La",
      "y"
    ],
    [
      "Lay",
      "er"
    ],
    [
      "N",
      "orma"
    ],
    [
      "Norma",
      "li"
    ],
    [
      "Normali",
      "z"
    ],
    [
      "Normaliz",
      "at"
    ],
    [
      "Normalizat",
      "i"
    ],
    [
      "Normalizati",
      "on"
    ],
    [
      "归",
      "一"
    ],
    [
      "归一",
      "化"
    ],
    [
      "解",
      "释"
    ],
    [
      "的",
      "编程"
    ],
    [
      "希",
      "望"
    ],
    [
      "1",
      "0"
    ],
    [
      "质",
      "数"
    ],
    [
      "例",
      "如"
    ],
    [
      "都",
      "是"
    ],
    [
      "动",
      "物"
    ],
    [
      "li",
      "s"
    ],
    [
      "lis",
      "t"
    ],
    [
      "你",
      "的"
    ],
    [
      "i",
      "t"
    ],
    [
      "偏",
      "好"
    ],
    [
      "具",
      "体"
    ],
    [
      "奖励",
      "模型"
    ],
    [
      "上",
      "好"
    ],
    [
      "Py",
      "T"
    ],
    [
      "PyT",
      "or"
    ],
    [
      "PyTor",
      "ch"
    ],
    [
      "K",
      "L"
    ],
    [
      "at",
      "ch"
    ],
    [
      "一",
      "下"
    ],
    [
      "小型",
      "语言模型"
    ],
    [
      "训练",
      "的"
    ],
    [
      "但",
      "我"
    ],
    [
      "包",
      "括"
    ],
    [
      "等",
      "方法"
    ],
    [
      "识",
      "别"
    ],
    [
      "知",
      "识"
    ],
    [
      "怎",
      "么"
    ],
    [
      "没",
      "有"
    ],
    [
      "一",
      "些"
    ],
    [
      "简单",
      "的"
    ],
    [
      "对",
      "于"
    ],
    [
      "讲",
      "一个"
    ],
    [
      "为",
      "什么"
    ],
    [
      "2",
      "5"
    ],
    [
      "1",
      "等于"
    ],
    [
      "lo",
      "w"
    ],
    [
      "这",
      "是"
    ],
    [
      "的",
      "基础"
    ],
    [
      "喜",
      "欢"
    ],
    [
      "作",
      "为"
    ],
    [
      "设",
      "计"
    ],
    [
      "人",
      "们"
    ],
    [
      "看",
      "到"
    ],
    [
      "反",
      "馈"
    ],
    [
      "GP",
      "T"
    ],
    [
      "由",
      "于"
    ],
    [
      "2",
      "0"
    ],
    [
      "相",
      "关"
    ],
    [
      "它",
      "计算"
    ],
    [
      "求",
      "和"
    ],
    [
      "循",
      "环"
    ],
    [
      "你",
      "是"
    ],
    [
      "你是",
      "谁"
    ],
    [
      "规",
      "律"
    ],
    [
      "监",
      "督"
    ],
    [
      "区",
      "别"
    ],
    [
      "多",
      "层"
    ],
    [
      "特",
      "征"
    ],
    [
      "组",
      "成"
    ],
    [
      "权",
      "重"
    ],
    [
      "调",
      "整"
    ],
    [
      "GP",
      "U"
    ],
    [
      "加",
      "速"
    ],
    [
      "数据",
      "上"
    ],
    [
      "方",
      "向"
    ],
    [
      "更",
      "新"
    ],
    [
      "逐",
      "步"
    ],
    [
      "o",
      "k"
    ],
    [
      "ok",
      "en"
    ],
    [
      "常用",
      "的"
    ],
    [
      "激",
      "活"
    ],
    [
      "概率",
      "分布"
    ],
    [
      "残",
      "差"
    ],
    [
      "残差",
      "连接"
    ],
    [
      "直",
      "接"
    ],
    [
      "梯度",
      "消"
    ],
    [
      "梯度消",
      "失"
    ],
    [
      "分布",
      "更"
    ],
    [
      "稳",
      "定"
    ],
    [
      "方",
      "式"
    ],
    [
      "统",
      "计"
    ],
    [
      "你",
      "有"
    ],
    [
      "等于",
      "多少"
    ],
    [
      "只",
      "能"
    ],
    [
      "自",
      "身"
    ],
    [
      "所有",
      "猫"
    ],
    [
      "都",
      "会呼吸"
    ],
    [
      "f",
      "or"
    ],
    [
      "执",
      "行"
    ],
    [
      "的",
      "数据"
    ],
    [
      "递",
      "归"
    ],
    [
      "情",
      "况"
    ],
    [
      "休",
      "息"
    ],
    [
      "A",
      "P"
    ],
    [
      "AP",
      "I"
    ],
    [
      "核",
      "心"
    ],
    [
      "阳",
      "光"
    ],
    [
      "蚂",
      "蚁"
    ],
    [
      "地球",
      "到"
    ],
    [
      "地球到",
      "月"
    ],
    [
      "地球到月",
      "球"
    ],
    [
      "的",
      "平"
    ],
    [
      "万",
      "公"
    ],
    [
      "万公",
      "里"
    ],
    [
      "0",
      "."
    ],
    [
      "太",
      "阳"
    ],
    [
      "行",
      "星"
    ],
    [
      "王",
      "星"
    ],
    [
      "天",
      "空"
    ],
    [
      "蓝",
      "色"
    ],
    [
      "散",
      "射"
    ],
    [
      "₂",
      "O"
    ],
    [
      "的",
      "过程"
    ],
    [
      "我",
      "不"
    ],
    [
      "安",
      "全"
    ],
    [
      "伤",
      "害"
    ],
    [
      "特",
      "定"
    ],
    [
      "场",
      "景"
    ],
    [
      "O",
      "p"
    ],
    [
      "Op",
      "en"
    ],
    [
      "Open",
      "AI"
    ],
    [
      "A",
      "n"
    ],
    [
      "An",
      "th"
    ],
    [
      "Anth",
      "rop"
    ],
    [
      "Anthrop",
      "i"
    ],
    [
      "Anthropi",
      "c"
    ],
    [
      "放",
      "松"
    ],
    [
      "保",
      "持"
    ],
    [
      "的",
      "方法"
    ],
    [
      "人类",
      "偏好"
    ],
    [
      "P",
      "P"
    ],
    [
      "PP",
      "O"
    ],
    [
      "限",
      "制"
    ],
    [
      "的",
      "一"
    ],
    [
      "适",
      "应"
    ],
    [
      "S",
      "F"
    ],
    [
      "SF",
      "T"
    ],
    [
      "散",
      "度"
    ],
    [
      "op",
      "-"
    ],
    [
      "位置",
      "编"
    ],
    [
      "位置编",
      "码"
    ],
    [
      "掩",
      "码"
    ],
    [
      "数据",
      "增"
    ],
    [
      "数据增",
      "强"
    ],
    [
      "A",
      "d"
    ],
    [
      "Ad",
      "am"
    ],
    [
      "优化",
      "器"
    ],
    [
      "梯度",
      "裁剪"
    ],
    [
      "介",
      "绍"
    ],
    [
      "一个",
      "小型语言模型"
    ],
    [
      "规",
      "模"
    ],
    [
      "正",
      "在"
    ],
    [
      "让",
      "计算"
    ],
    [
      "让计算",
      "机"
    ],
    [
      "它",
      "包括"
    ],
    [
      "实",
      "现"
    ],
    [
      "语",
      "音"
    ],
    [
      "自",
      "然"
    ],
    [
      "功",
      "能"
    ],
    [
      "学习",
      "编程"
    ],
    [
      "学习",
      "基础"
    ],
    [
      "学习基础",
      "语"
    ],
    [
      "学习基础语",
      "法"
    ],
    [
      "动",
      "手"
    ],
    [
      "写",
      "代码"
    ],
    [
      "练",
      "习"
    ],
    [
      "做",
      "小"
    ],
    [
      "巩",
      "固"
    ],
    [
      "抱",
      "歉"
    ],
    [
      "我",
      "无"
    ],
    [
      "我无",
      "法"
    ],
    [
      "天气",
      "信息"
    ],
    [
      "你",
      "会"
    ],
    [
      "数学",
      "题"
    ],
    [
      "我可以",
      "尝"
    ],
    [
      "我可以尝",
      "试"
    ],
    [
      "计算",
      "能力"
    ],
    [
      "有",
      "限"
    ],
    [
      "复",
      "杂"
    ],
    [
      "的",
      "计算"
    ],
    [
      "建议",
      "使用"
    ],
    [
      "软",
      "件"
    ],
    [
      "好",
      "的"
    ],
    [
      "是",
      "分"
    ],
    [
      "e",
      "c"
    ],
    [
      "进",
      "制"
    ],
    [
      "进制",
      "的"
    ],
    [
      "本",
      "书"
    ],
    [
      "G",
      "o"
    ],
    [
      "Go",
      "o"
    ],
    [
      "和",
      "深度学习"
    ],
    [
      "的基础",
      "知识"
    ],
    [
      "被",
      "设计"
    ],
    [
      "被设计",
      "来"
    ],
    [
      "帮助",
      "人们"
    ],
    [
      "进行",
      "对话"
    ],
    [
      "1",
      "+"
    ],
    [
      "1+",
      "1等于"
    ],
    [
      "运",
      "算"
    ],
    [
      "可以",
      "问"
    ],
    [
      "可以问",
      "我"
    ],
    [
      "回答",
      "问题"
    ],
    [
      "小型",
      "模型"
    ],
    [
      "帮助",
      "你"
    ],
    [
      "架",
      "构"
    ],
    [
      "1",
      "7"
    ],
    [
      "它",
      "使用"
    ],
    [
      "关",
      "注"
    ],
    [
      "中",
      "最"
    ],
    [
      "它计算",
      "每个"
    ],
    [
      "位置",
      "的"
    ],
    [
      "相关",
      "性"
    ],
    [
      "根",
      "据"
    ],
    [
      "重要",
      "信息"
    ],
    [
      "变",
      "量"
    ],
    [
      "实",
      "际"
    ],
    [
      "实际",
      "项目"
    ],
    [
      "阅",
      "读"
    ],
    [
      "他",
      "人"
    ],
    [
      "创",
      "造"
    ],
    [
      "教",
      "学"
    ],
    [
      "教学",
      "演"
    ],
    [
      "教学演",
      "示"
    ],
    [
      "教学演示",
      "用"
    ],
    [
      "教学演示用",
      "的"
    ],
    [
      "工",
      "作"
    ],
    [
      "分",
      "支"
    ],
    [
      "数据",
      "中"
    ],
    [
      "数据中",
      "学习"
    ],
    [
      "而",
      "不"
    ],
    [
      "监督",
      "学习"
    ],
    [
      "有什么",
      "区别"
    ],
    [
      "是",
      "机器学习"
    ],
    [
      "自",
      "动"
    ],
    [
      "N",
      "L"
    ],
    [
      "NL",
      "P"
    ],
    [
      "显",
      "著"
    ],
    [
      "结",
      "构"
    ],
    [
      "神经",
      "元"
    ],
    [
      "最",
      "终"
    ],
    [
      "矩",
      "阵"
    ],
    [
      "模型",
      "在"
    ],
    [
      "数据上",
      "表"
    ],
    [
      "数据上表",
      "现"
    ],
    [
      "差",
      "的"
    ],
    [
      "用",
      "正"
    ],
    [
      "则",
      "化"
    ],
    [
      "增",
      "加"
    ],
    [
      "增加",
      "数据"
    ],
    [
      "缓",
      "解"
    ],
    [
      "衡",
      "量"
    ],
    [
      "的",
      "差"
    ],
    [
      "目标",
      "是"
    ],
    [
      "目标是",
      "最"
    ],
    [
      "小",
      "化"
    ],
    [
      "小化",
      "损失函数"
    ],
    [
      "常",
      "见"
    ],
    [
      "回",
      "归"
    ],
    [
      "分",
      "类"
    ],
    [
      "梯度",
      "下"
    ],
    [
      "梯度下",
      "降"
    ],
    [
      "找",
      "到"
    ],
    [
      "最",
      "优"
    ],
    [
      "太",
      "大"
    ],
    [
      "通",
      "常"
    ],
    [
      "T",
      "oken"
    ],
    [
      "Token",
      "i"
    ],
    [
      "Tokeni",
      "z"
    ],
    [
      "Tokeniz",
      "er"
    ],
    [
      "词",
      "级"
    ],
    [
      "词",
      "表"
    ],
    [
      "语",
      "义"
    ],
    [
      "E",
      "m"
    ],
    [
      "Em",
      "be"
    ],
    [
      "Embe",
      "d"
    ],
    [
      "Embed",
      "d"
    ],
    [
      "Embedd",
      "in"
    ],
    [
      "Embeddin",
      "g"
    ],
    [
